# 3-2 디버깅 연습하기

#print("오늘은 파이썬 챌린지 3일차 입니다)
print("오늘은 파이썬 챌린지 3일차 입니다")

#print('디버깅 "+" 연습중입니다')
print('디버깅 '+' 연습중입니다')

# print('내일은("금요일" + "입니다)')
##print('내일은("금요일" + "입니다)')
print('내일은'+"금요일" + "입니다")

#print(("그래서 챌린지가 없습니다"))
print("그래서 챌린지가 없습니다")

# SyntaxError: EOL while scanning string literal
## 오늘은 파이썬 챌린지 3일차 입니다

# 따옴표 짝이 안 맞으니까 +를 문장 내 문자로 인식
## 디버깅  연습중입니다

# IndentationError: unexpected indent
# 내일은("금요일" + "입니다)
## 내일은금요일입니다

# 그래서 챌린지가 없습니다
## 그래서 챌린지가 없습니다
